[Killed] BlockStatement
src/index.ts:15:42
  * Can for example be used to get the current date when logging.
  * @returns DateFunction function returning the current data
  */
-function nowDateFunction(): DateFunction {
-    return (): Date => new Date()
-}
+function nowDateFunction(): DateFunction {}
 
 /**
killedBy: Test date functions
statusReason: dateFunction is not a function

[Killed] ArrowFunction
src/index.ts:16:12
  * @returns DateFunction function returning the current data
  */
 function nowDateFunction(): DateFunction {
-    return (): Date => new Date()
+    return () => undefined
 }
 
killedBy: Test date functions
statusReason: Cannot read properties of undefined (reading 'toISOString')

[Killed] BlockStatement
src/index.ts:25:62
  * @param dateString fixed date string
  * @returns DateFunction function returning the fixed date
  */
-function fixedDateFunction(dateString: string): DateFunction {
-    return (): Date => new Date(dateString)
-}
+function fixedDateFunction(dateString: string): DateFunction {}
 
 /**
killedBy: Test date functions
statusReason: expected '2025-05-19T11:32:49.702Z : I am a log…' to be '2023-09-06T00:00:00.000Z : I am a log…' // Object.is equality

[Killed] ArrowFunction
src/index.ts:26:12
  * @returns DateFunction function returning the fixed date
  */
 function fixedDateFunction(dateString: string): DateFunction {
-    return (): Date => new Date(dateString)
+    return () => undefined
 }
 
killedBy: Test date functions
statusReason: Cannot read properties of undefined (reading 'toISOString')

[Killed] BlockStatement
src/index.ts:63:18
 function fixedResponseFetchFunction(
     bodyInit?: BodyInit,
     init?: ResponseInit,
-): FetchFunction {
-    return (): Promise<Response> =>
-        Promise.resolve(new Response(bodyInit, init))
-}
+): FetchFunction {}
 
 /**
killedBy: Test fetch functions
statusReason: expected 'Error: TypeError: fetch failed' to be 'User John Doe' // Object.is equality

[Killed] ArrowFunction
src/index.ts:64:12
     bodyInit?: BodyInit,
     init?: ResponseInit,
 ): FetchFunction {
-    return (): Promise<Response> =>
-        Promise.resolve(new Response(bodyInit, init))
+    return () => undefined
 }
 
killedBy: Test fetch functions
statusReason: expected 'Error: TypeError: Cannot read propert…' to be 'User John Doe' // Object.is equality

[Killed] BlockStatement
src/index.ts:115:33
  * FetchFunction that returns a fixed Response that throws a Timeout error.
  */
 const timeoutFetchFunction: FetchFunction = (): Promise<Response> =>
-    new Promise<Response>(() => {
-        throw new Error('Connection failed ETIMEDOUT')
-    })
+    new Promise<Response>(() => {})
 
 /**
killedBy: Test fetch functions
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/index.ts:116:25
  */
 const timeoutFetchFunction: FetchFunction = (): Promise<Response> =>
     new Promise<Response>(() => {
-        throw new Error('Connection failed ETIMEDOUT')
+        throw new Error("")
     })
 
killedBy: Test fetch functions
statusReason: expected 'Error: Error' to be 'Error: Error: Connection failed ETIME…' // Object.is equality

[Killed] BlockStatement
src/index.ts:171:66
  * @returns {never} Does not return anything but throws an error with the message
  * "Exit function was called with code CODE" where CODE is the given code.
  */
-const doNotExitFunction: ExitFunction = (code: number): never => {
-    throw new Error(`Exit function was called with code ${code}`)
-}
+const doNotExitFunction: ExitFunction = (code: number): never => {}
 
 // Timeout function related types and functions
killedBy: Test exit functions
statusReason: expected [Function] to throw an error
